astb_relise/src/Documents/ЦеновоеСоглашениеПоРемонту/ЦеновоеСоглашениеПоРемонту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦеновоеСоглашениеПоРемонту</name>
  <registerRecords>InformationRegister.ЦеныРемонта</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРемонта</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтаСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ЦеновоеСоглашениеПоРемонту/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновоеСоглашениеПоРемонтуВидыРемонта.Ссылка.Дата КАК Период,
	|	ЦеновоеСоглашениеПоРемонтуВидыРемонта.Ссылка.Организация,
	|	ЦеновоеСоглашениеПоРемонтуВидыРемонта.Ссылка.Контрагент,
	|	ЦеновоеСоглашениеПоРемонтуВидыРемонта.ВидРемонта,
	|	ЦеновоеСоглашениеПоРемонтуВидыРемонта.Цена
	|ИЗ
	|	Документ.ЦеновоеСоглашениеПоРемонту.ВидыРемонта КАК ЦеновоеСоглашениеПоРемонтуВидыРемонта
	|ГДЕ
	|	ЦеновоеСоглашениеПоРемонтуВидыРемонта.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицыДляДвижений.Вставить("ТаблицаЦеныРемонта", Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

#КонецЕсли
